app/controllers/articles_controller.rb

INSERT INTO `articles` (`content`, `created_at`, `is_internal`, `sub_content`, `title`, `updated_at`, `url`, `user_id`) VALUES ('<i><font color=\"#ccc\">gfjhhj fh fgh</font>&nbsp; </i>fghfg fg fg<br>', '2012-11-26 06:09:29', NULL, NULL, 'Testing', '2012-11-26 06:09:29', NULL, NULL)
---
  def create
    @article = current_user.articles.build(params[:article])
    @article.save()