app/controllers/home_controller.rb

  def welcome
    @articles = Article.all || []
---
SELECT `articles`.* FROM `articles`