app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
---
  def show
    @project = Project.find(params[:id])

INSERT INTO `projects` (`created_at`, `description`, `image`, `name`, `title`, `updated_at`, `url`) VALUES ('2013-01-12 07:57:14', 'This is my personal site', 'document.png', 'My Site', 'Simple Project', '2013-01-12 07:57:14', 'http://localhost:3000/projects/new')
---
  def create
    @project = Project.new(params[:project])

    respond_to do |format|
      if @project.save